// Напишите программу, которая на вход принимает два числа и выдаёт,
// какое число большее, а какое меньшее.

int A = -9;
int B = -3;

int max = B;
int min = A;

Console.Write("Max = ");
Console.WriteLine(max);

Console.Write("Min = ");
Console.WriteLine(min);